Repository: KDE/heaptrack
Catalog: po/*/heaptrack.po
Languages: eo, it

# NAME OF TRANSLATORS
source: Your names
it: Vincenzo Reale

# EMAIL OF TRANSLATORS
source: Your emails
it: smart2128vr@gmail.com

source: Location
eo: Loko
it: Posizione

source: Allocations (Self)
eo: Asignoj (Mem)
it: Allocazioni (proprie)

source: Temporary (Self)
eo: Provizora (Memo)
it: Temporanea (propria)

source: Peak (Self)
eo: Pinto (Memo)
it: Picco (propria)

source: Leaked (Self)
eo: Likita (Memo)
it: Persa (propria)

source: Allocations (Incl.)
eo: Asignoj (inkl.)
it: Allocazioni (incl.)

source: Temporary (Incl.)
eo: Provizora (Inkl.)
it: Temporanea (incl.)

source: Peak (Incl.)
eo: Pinto (inkl.)
it: Picco (incl.)

source: Leaked (Incl.)
eo: Likita (Inkl.)
it: Persa (incl.)

source: <qt>The parent symbol that called an allocation function. The function name may be unresolved when debug information is missing.</qt>
it: <qt>Il simbolo genitore che chiamava una funzione di allocazione. Il nome della funzione può essere irrisolto quando mancano le informazioni sul debug.</qt>

source: <qt>The number of times an allocation function was directly called from this location.</qt>
it: <qt>Il numero di volte in cui una funzione di allocazione è stata chiamata direttamente da questa posizione.</qt>

source: <qt>The number of direct temporary allocations. These allocations are directly followed by a free without any other allocations in-between.</qt>
it: <qt>Il numero di allocazioni temporanee dirette. Queste allocazioni sono seguite direttamente da una libera senza altre allocazioni in mezzo.</qt>

source: <qt>The maximum heap memory in bytes consumed from allocations originating directly at this location. This takes deallocations into account.</qt>
it: <qt>La memoria massima di heap in byte consumata da allocazioni originate direttamente in questa posizione. Questo tiene conto delle deallocazioni.</qt>

source: <qt>The bytes allocated directly at this location that have not been deallocated.</qt>
it: <qt>I byte assegnati direttamente in questa posizione che non sono stati deallocati.</qt>

source: <qt>The inclusive number of times an allocation function was called from this location or any functions called from here.</qt>
it: <qt>Il numero inclusivo di volte in cui una funzione di allocazione è stata chiamata da questa posizione o qualsiasi funzioni chiamate da qui. </qt>

source: <qt>The number of inclusive temporary allocations. These allocations are directly followed by a free without any other allocations in-between.</qt>
it: <qt>Il numero di allocazioni temporanee inclusive. Queste allocazioni sono direttamente seguite da una libera senza altre allocazioni in mezzo.</qt>

source: <qt>The inclusive maximum heap memory in bytes consumed from allocations originating at this location or from functions called from here. This takes deallocations into account.</qt>
it: <qt>La memoria massima di heap inclusiva in byte consumata da allocazioni originate in questa posizione o dalle funzioni chiamate da qui. Questo tiene conto delle deallocazioni.</qt>

source: <qt>The bytes allocated at this location that have not been deallocated.</qt>
it: <qt>I byte assegnati in questa posizione che non sono stati deallocati.</qt>

source: Caller
eo: Alvokanto
it: Chiamante

source: Callee
it: Chiamato

source: Peak
eo: Pinto
it: Picco

source: Leaked
eo: Likita
it: Persa

source: Allocations
eo: Asignoj
it: Allocazioni

source: Temporary
eo: Provizora
it: Temporaneo

source: The location of the %1. The function name may be unresolved when debug information is missing.
it: La posizione del %1. Il nome della funzione può essere irrisolto quando mancano le informazioni sul debug.

source: <qt>The source code location that called an allocation function. May be unknown when debug information is missing.</qt>
it: <qt>La posizione del codice sorgente che chiamava una funzione di allocazione. Può essere sconosciuto quando mancano le informazioni sul debug.</qt>

source: Memory Allocations
eo: Memoraj Atribuoj
it: Allocazioni di memoria

source: Memory Consumed
eo: Memoro Konsumita
it: Memoria consumata

source: Temporary Allocations
eo: Provizora Asignoj
it: Allocazioni temporanee

source: Elapsed Time
eo: Pasinta tempo
it: Tempo trascorso

source: Total Memory Allocations
eo: Totalaj Memoraj Atribuoj
it: Allocazioni di memoria totali

source: Total Memory Consumption
eo: Totala Memorkonsumo
it: Consumo totale di memoria

source: Total Temporary Allocations
eo: Tutaj Provizoraj Asignoj
it: Allocazioni temporanee totali

# %1: the formatted byte size, e.g. "1.2KB", %2: the raw byte size, e.g. "1300"
source: %1 (%2 bytes)
it: %1 (%2 byte)

source: <qt>%1 allocations in total after %2</qt>
eo: <qt>%1 asignoj entute post %2</qt>
it: <qt>%1 allocazioni in totale dopo %2</qt>

source: <qt>%1 temporary allocations in total after %2</qt>
eo: <qt>%1 provizoraj asignoj entute post %2</qt>
it: <qt>%1 allocazioni temporanee in totale dopo %2</qt>

source: <qt>%1 consumed in total after %2</qt>
eo: <qt>%1 konsumita entute post %2</qt>
it: <qt>%1 consumati in totale dopo %2</qt>

source: <qt>%2 allocations after %3 from:<p style='margin-left:10px;'>%1</p></qt>
it: <qt>%2 allocazioni dopo %3 da: <p style='margin-left: 10px;'>%1</p></qt>

source: <qt>%2 temporary allocations after %3 from:<p style='margin-left:10px'>%1</p></qt>
it: <qt>%2 allocazioni temporanee dopo %3 da: <p style='margin-left: 10px'>%1</p></qt>

source: <qt>%2 consumed after %3 from:<p style='margin-left:10px'>%1</p></qt>
eo: <qt>%2 konsumita post %3 de:<p style='margin-left:10px'>%1</p></qt>
it: <qt>%2 consumati dopo %3 da: <p style='margin-left: 10px'>%1</p></qt>

source: Export As...
eo: Eksporti kiel...
it: Esporta come...

source: Show legend
eo: Montri klarigeton
it: Mostra legenda

source: Show total cost graph
eo: Montri sumkostan grafikon
it: Mostra il grafico del costo totale

source: Show detailed cost graph
eo: Montri detalan kostografikon
it: Mostra il grafico dettagliato dei costi

source: Stacked diagrams:
eo: Stakitaj diagramoj:
it: Diagrammi a colonne:

source: Filter In On Selection
eo: Filtrilo En Elekto
it: Filtro sulla selezione

source: Reset Filter
eo: Restarigi Filtrilon
it: Azzera filtro

source: Save %1
eo: Konservi %1
it: Salva %1

source: Raster Image (*.png *.jpg *.tiff);;Vector Image (*.svg)
eo: Rastrumbildo (*.png *.jpg *.tiff);;Vekktorbildo (*.svg)
it: Immagine raster (*.png *.jpg *.tiff);;Immagine vettoriale (*.svg)

source: Failed to save the image to %1
eo: Malsukcesis konservi la bildon al %1
it: Impossibile salvare l'immagine in %1.

source: <tr><th></th><th>Start</th><th>End</th><th>Delta</th></tr>
eo: <tr><th></th><th>Komenco</th><th>Fino</th><th>Delta</th></tr>
it: <tr><th></th><th>Inizio</th><th>Fine</th><th>Delta</th></tr>

source: <tr><th>Time</th><td>%1</td><td>%2</td><td>%3</td></tr>
eo: <tr><th>Tempo</th><td>%1</td><td>%2</td><td>%3</td></tr>
it: <tr><th>Tempo</th><td>%1</td><td>%2</td><td>%3</td></tr>

source: <tr><th>Consumed</th><td>%1</td><td>%2</td><td>%3</td></tr>
eo: <tr><th>Konsumita</th><td>%1</td><td>%2</td><td>%3</td></tr>
it: <tr><th>Consumati</th><td>%1</td><td>%2</td><td>%3</td></tr>

source: <tr><th>Allocations</th><td>%1</td><td>%2</td><td>%3</td></tr>
eo: <tr><th>Asignoj</th><td>%1</td><td>%2</td><td>%3</td></tr>
it: <tr><th>Allocazioni</th><td>%1</td><td>%2</td><td>%3</td></tr>

source: <tr><th>Temporary Allocations</th><td>%1</td><td>%2</td><td>%3</td></tr>
it: <tr><th>Allocazioni temporanee</th><td>%1</td><td>%2</td><td>%3</td></tr>

source: <qt>Shows the heap memory consumption over time.<br>Click and drag to select a time range for filtering.</qt>
it: <qt>Mostra il consumo di memoria heap nel tempo.<br>Fai clic e trascina per selezionare un intervallo di tempo per il filtro.</qt>

source: <qt>Shows number of memory allocations over time.<br>Click and drag to select a time range for filtering.</qt>
it: <qt>Mostra il numero di allocazioni di memoria nel tempo.<br>Fai clic e trascina per selezionare un intervallo di tempo per il filtro.</qt>

source: <qt>Shows number of temporary memory allocations over time. A temporary allocation is one that is followed immediately by its corresponding deallocation, without other allocations happening in-between.<br>Click and drag to select a time range for filtering.</qt>
it: <qt>Mostra il numero di allocazioni temporanee di memoria nel tempo. Un'allocazione temporanea è quella che viene seguita immediatamente dalla deallocazione corrispondente, senza altre allocazioni che si verificano in mezzo.<br>Fai clic e trascina per selezionare un intervallo di tempo per il filtro.</qt>

source: %1 (filtered from %2 to %3, Δ%4)
eo: %1 (filtrita de %2 al %3, Δ%4)
it: %1 (filtrato da %2 a %3, Δ%4)

source: %1 (filtered delta)
eo: %1 (filtrita delto)
it: %1 (delta filtrato)

source: Click and drag to select time range for filtering.
eo: Klaku kaj trenu por elekti tempoperiodon por filtri.
it: Fai clic e trascina per selezionare l'intervallo di tempo per il filtro.

source: T = %1, Consumed: %2. Click and drag to select time range for filtering.
it: T = %1, consumato: %2. Fai clic e trascina per selezionare l'intervallo di tempo per il filtro.

source: T = %1, Allocations: %2. Click and drag to select time range for filtering.
it: T = %1, allocazioni: %2. Fai clic e trascina per selezionare l'intervallo di tempo per il filtro.

source: T = %1, Temporary Allocations: %2. Click and drag to select time range for filtering.
it: T = %1, allocazioni temporanee: %2. Fai clic e trascina per selezionare l'intervallo di tempo per il filtro.

source: %1 allocations in total
eo: %1 asignoj entute
it: %1 allocazioni in totale

source: %1 temporary allocations in total
eo: %1 provizoraj asignoj entute
it: %1 allocazioni temporanee in totale

source: %1 peak memory consumption
eo: %1 pinta memorkonsumo
it: %1 consumo di memoria di picco

source: %1 leaked in total
eo: %1 likis entute
it: %1 persi in totale

# %1: number of allocations, %2: relative number, %3: function label
source: %1 (%2%) allocations in %3 and below.
eo: %1 (%2%) asignoj en %3 kaj malsupre.
it: %1 (%2%) allocazioni in %3 e inferiori.

# %1: number of temporary allocations, %2: relative number, %3 function label
source: %1 (%2%) temporary allocations in %3 and below.
it: %1 (%2%) allocazioni temporanee in %3 e inferiori.

# %1: peak consumption in bytes, %2: relative number, %3: function label
source: %1 (%2%) contribution to peak consumption in %3 and below.
it: %1 (%2%) contributi al consumo di picco in %3 e inferiori.

# %1: leaked bytes, %2: relative number, %3: function label
source: %1 (%2%) leaked in %3 and below.
eo: %1 (%2%) likis en %3 kaj sube.
it: %1 (%2%) persi in%3 e inferiore.

source: Memory Peak
eo: Memorpinto
it: Picco di memoria

source: Show a flame graph over the contributions to the peak heap memory consumption of your application.
it: Mostra un grafico a fiamma sui contributi al consumo di memoria di picco della tua applicazione.

source: Show a flame graph over the leaked heap memory of your application. Memory is considered to be leaked when it never got deallocated.
it: Mostra un grafico a fiamma sopra la memoria heap persa dell'applicazione. La memoria è considerata persa quando non è mai deallocata.

source: Show a flame graph over the number of allocations triggered by functions in your code.
it: Mostra un grafico a fiamma sul numero di allocazioni attivate dalle funzioni nel tuo codice.

source: Show a flame graph over the number of temporary allocations triggered by functions in your code. Allocations are marked as temporary when they are immediately followed by their deallocation.
it: Mostra un grafico a fiamma sul numero di allocazioni temporanee innescate dalle funzioni nel tuo codice. Le allocazioni sono contrassegnate come temporanee quando vengono immediatamente seguite dalla loro deallocazione.

source: Select the data source that should be visualized in the flame graph.
eo: Elektu la datumfonton, kiu devus esti bildigita en la flama grafiko.
it: Seleziona l'origine dati che deve essere visualizzata nel grafico a fiamma.

source: Bottom-Up View
eo: Malsupre Supre Vido
it: Vista dal basso verso l'alto

source: Enable the bottom-up flame graph view. When this is unchecked, the top-down view is enabled by default.
it: Abilita la vista grafico a fiamma dal basso verso l'alto. Se non viene marcata, la vista dall'alto verso il basso è abilitata per impostazione predefinita.

source: Collapse Recursion
eo: Malvastigi Rekurso
it: Contrai la ricorsione

source: Collapse stack frames for functions calling themselves. When this is unchecked, recursive frames will be visualized separately.
it: Contrai dei frame dello stack per le funzioni che invocano se stesse. Se non è marcato, i frame ricorsivi saranno visualizzati separatamente.

source: Cost Threshold:
eo: Kosta Sojlo:
it: Soglia di costo:

source: <qt>The cost threshold defines a fractional cut-off value. Items with a relative cost below this value will not be shown in the flame graph. This is done as an optimization to quickly generate graphs for large data sets with low memory overhead. If you need more details, decrease the threshold value, or set it to zero.</qt>
it: <qt>La soglia di costo definisce un valore di taglio frazionario. Gli elementi con un costo relativo al di sotto di questo valore non saranno visualizzati nel grafico a fiamma. Questo viene fatto come ottimizzazione per generare rapidamente grafici per insiemi di dati di grandi dimensioni con sovraccarico di memoria bassa. Se hai bisogno di maggiori dettagli, riduci il valore di soglia o impostarlo su zero.</qt>

source: Search...
eo: Serĉi...
it: Cerca...

source: <qt>Search the flame graph for a symbol.</qt>
eo: <qt>Traserĉi la flamgrafeon por simbolo.</qt>
it: <qt>Cerca il grafico a fiamma per un simbolo.</qt>

source: Reset View
eo: Restarigi la vidaĵon
it: Ripristina la vista

source: View Caller/Callee
eo: Vidi Alvokanto/Alvokanto
it: Visualizza il chiamante/chiamato

source: generating flame graph...
eo: generante flamgrafikon...
it: generazione del grafico a fiamma...

source: %1 (%2% of total of %3) allocations matched by search.
eo: %1 (%2% de totalo de %3) asignoj kongruaj per serĉo.
it: %1 (%2% del totale di %3) allocazioni verificate dalla ricerca.

source: %1 (%2% of total of %3) matched by search.
eo: %1 (%2% de totalo de %3) kongruis per serĉo.
it: %1 (%2% del totale di %3) verificate per ricerca.

source: Heaptrack GUI
it: Interfaccia di Heaptrack

source: A visualizer for heaptrack data files.
eo: Vidilo por heaptrack datumdosieroj.
it: Un visualizzatore per i file di dati di heaptrack.

source: Original author, maintainer
eo: Origina aŭtoro, prizorganto
it: Autore originale, responsabile

source: Base profile data to compare other files to.
eo: Bazaj profilaj datumoj por kompari aliajn dosierojn.
it: Base dei dati del profilo con la quale confrontare gli altri file.

source: Load list of leak suppressions from the specified file. Specify one suppression per line, and start each line with 'leak:', i.e. use the LSAN suppression file format.
it: Elenco di caricamento delle soppressioni di perdite dal file specificato. Specifica una soppressione per riga e inizia ogni riga con «leak», ovvero utilizza il formato del file di soppressione LSAN.

source: Ignore suppression definitions that are embedded into the heaptrack data file. By default, heaptrack will copy the suppressions optionally defined via a `const char *__lsan_default_suppressions()` symbol in the debuggee application. These are then always applied when analyzing the data, unless this feature is explicitly disabled using this command line option.
it: Ignora le definizioni di soppressione che sono incorporate nel file di dati heaptrack. Per impostazione predefinita, heaptrack copierà le soppressioni facoltativamente definite tramite un simbolo `const char *__ lsan_default_suppressions ()` nell'applicazione Debuggee. Queste sono sempre applicati durante l'analisi dei dati, a meno che questa funzionalità non sia esplicitamente disabilitata utilizzando questa opzione della riga di comando.

source: Ignore suppression definitions that are built into heaptrack. By default, heaptrack will suppress certain known leaks in common system libraries.
it: Ignora le definizioni di soppressione integrate in heaptrack. Per impostazione predefinita, heaptrack sopprimerà alcune perdite note nelle librerie di sistema comuni.

source: Files to load
eo: Dosieroj por ŝargi
it: File da caricare

source: %1 allocations from %2, totalling %3 allocated with an average of %4 per allocation
it: %1 allocazioni da %2, totale %3 allocato con una media di %4 per allocazione

source: Requested Allocation Size
eo: Petita Asigno Grandeco
it: Dimensione di allocazione richiesta

source: Number of Allocations
eo: Nombro de Asignoj
it: Numero di allocazioni

source: Open file in editor
eo: Malfermi dosieron en redaktilo
it: Apri il file nell'editor

source: <dt><b>debuggee</b>:</dt><dd style='font-family:monospace;'>%1 <i>(attached)</i></dd>
it: <dt><b>debuggee</b>:</dt><dd style='font-family:monospace;'>%1 <i>(allegato)</i></dd>

source: <dt><b>total runtime</b>:</dt><dd>%1, filtered from %2 to %3 (%4)</dd>
eo: <dt><b>tuta rultempo</b>:</dt><dd>%1, filtrita de %2 al %3 (%4)</dd>
it: <dt><b>tempo di esecuzione totale</b>:</dt><dd>%1, filtrato da %2 a %3 (%4)</dd>

source: <dt><b>total runtime</b>:</dt><dd>%1</dd>
eo: <dt><b>tuta rultempo</b>:</dt><dd>%1</dd>
it: <dt><b>tempo di esecuzione totale</b>:</dt><dd>%1</dd>

source: <dt><b>total system memory</b>:</dt><dd>%1</dd>
eo: <dt><b>tuta sistemmemoro</b>:</dt><dd>%1</dd>
it: <dt><b>memoria di sistema totale</b>:</dt><dd>%1</dd>

source: <dt><b>calls to allocation functions</b>:</dt><dd>%1 (%2/s)</dd>
eo: <dt><b>vokoj al atribuaj funkcioj</b>:</dt><dd>%1 (%2/s)</dd>
it: <dt><b>chiamate alle funzioni di allocazione</b>:</dt><dd>%1 (%2/s)</dd>

source: <dt><b>temporary allocations</b>:</dt><dd>%1 (%2%, %3/s)</dd>
eo: <dt><b>provizoraj asignoj</b>:</dt><dd>%1 (%2%, %3/s)</dd>
it: <dt><b>allocazioni temporanee</b>:</dt><dd>%1 (%2%, %3/s)</dd>

source: <dt><b>peak heap memory consumption</b>:</dt><dd>%1 after %2</dd>
eo: <dt><b>Pinta amasa memorkonsumo</b>:</dt><dd>%1 post %2</dd>
it: <dt><b>consumo di memoria heap di picco</b>:</dt><dd>%1 dopo %2</dd>

source: <dt><b>peak RSS</b> (including heaptrack overhead):</dt><dd>%1</dd>
eo: <dt><b>pinta RSS</b> (inkluzive de heaptrack supra):</dt><dd>%1</dd>
it: <dt><b>RSS picco</b> (incluso il sovraccarico di heaptrack):</dt><dd>%1</dd>

source: <dt><b>memory consumption delta</b>:</dt><dd>%1</dd>
eo: <dt><b>delta konsumo de memoro</b>:</dt><dd>%1</dd>
it: <dt><b>delta del consumo di memoria</b>:</dt><dd>%1</dd>

source: <dt><b>total memory leaked</b>:</dt><dd>%1 (%2 suppressed)</dd>
eo: <dt><b>totala memoro likita</b>:</dt><dd>%1 (%2 subpremita)</dd>
it: <dt><b>memoria totale persa</b>:</dt><dd>%1 (%2 soppressi)</dd>

source: <dt><b>total memory leaked</b>:</dt><dd>%1</dd>
eo: <dt><b>totala memoro likita</b>:</dt><dd>%1</dd>
it: <dt><b>memoria totale persa</b>:</dt><dd>%1</dd>

source: Failed to parse file %1.
eo: Malsukcesis analizi dosieron %1.
it: Impossibile analizzare il file %1.

source: Consumed
eo: Konsumita
it: Consumata

source: Sizes
eo: Grandecoj
it: Dimensioni

source: Input data %1 does not exist.
eo: Eniga datumoj %1 ne ekzistas.
it: I dati di ingresso %1 non esistono.

source: Input data %1 is not a file.
eo: Eniga datumoj %1 ne estas dosiero.
it: I dati di ingresso %1 non sono un file.

source: Input data %1 is not readable.
eo: Eniga datumoj %1 ne estas legebla.
it: I dati di ingresso %1 non sono leggibili.

source: Failed to parse suppression file.
eo: Malsukcesis analizi subpreman dosieron.
it: Impossibile analizzare il file di soppressione.

source: Disable Embedded Suppressions
eo: Malebligi Enigitan Subpremojn
it: Disabilitare le soppressioni integrate

source: Disable Builtin Suppressions
eo: Malebligi Enkonstruitajn Subpremojn
it: Disabilita le soppressioni incorporate

source: Ignore suppression definitions that are built into heaptrack. By default, heaptrack will suppress certain known leaks from common system libraries.
it: Ignora le definizioni di soppressione integrate in heaptrack. Per impostazione predefinita, heaptrack sopprimerà alcune perdite note dalle libreria di sistema comuni.

source: Loading file %1, please wait...
eo: Ŝargante dosieron %1, bonvolu atendi...
it: Caricamento del file %1, attendi...

# %1, %2: file names that are open
source: Heaptrack - %1 compared to %2
eo: Heaptrack - %1 kompare kun %2
it: Heaptrack - %1 confrontato con %2

source: Reparsing file, please wait...
eo: Reparanta dosieron, bonvolu atendi...
it: Nuova elaborazione del file, attendi...

source: Code Navigation
eo: Koda Navigado
it: Navigazione nel codice

source: Custom...
eo: Propra...
it: Personalizzato...

source: Automatic (No Line numbers)
eo: Aŭtomata (Neniu Linia nombro)
it: Automatico (nessun numero di riga)

source: Custom Code Navigation
eo: Propra Kodo Navigado
it: Navigazione nel codice personalizzata

source: Specify command to use for code navigation, '%f' will be replaced by the file name, '%l' by the line number and '%c' by the column number.
it: Specifica il comando da utilizzare per la navigazione del codice, «%f» sarà sostituito dal nome del file, «%l» dal numero di riga e «%c» dal numero di colonna.

source: MainWindow
eo: Ĉeffenestro
it: Finestra principale

source: Path to a file containing leak suppression rules in the LSAN format.
eo: Vojo al dosiero enhavanta liksubpremadregulojn en la LSAN-formato.
it: Percorso a un file contenente regole di soppressione delle perdite nel formato LSAN.

source: Open Heaptrack Data
eo: Malfermi Heaptrack-Datumojn
it: Apri dati di Heaptrack

source: <qt><p>This field specifies the primary heaptrack data file. These files are called <tt>heaptrack.$APP.$PID.gz</tt> or <tt>heaptrack.$APP.$PID.zst</tt>. You can produce such a file by profiling your application, e.g. via:</p> <pre><code>heaptrack &lt;yourapplication&gt; ...</code></pre> <p>Or, alternatively, you can attach to a running process via</p> <pre><code>heaptrack --pid $(pidof &lt;yourapplication&gt;)</code></pre></qt>
it: <qt><p>Questo campo specifica il file di dati heaptrack principale. Questi file sono chiamati <tt>heaptrack. $APP.$PID.gz</tt> o <tt>heaptrack.$APP.$PID.zst</tt>. Puoi produrre un file del genere profilando la tua applicazione, ad es. tramite: </p> <pre><code>heaptrack &lt;latuaapplicazione&gt; ...</code></pre> <p>o, in alternativa, puoi collegarti a un processo di esecuzione tramite</p> <pre><code>heaptrack --pid $(pidof &lt;latuaapplicazione&gt;)</code></pre></qt>

source: path/to/heaptrack.$APP.$PID.{gz,zst}
eo: vojo/al/heaptrack.$APP.$PID.{gz,zst}
it: percorso/a/heaptrack.$APP.$PID.{gz, zst}

source: <qt>You can optionally specify a second heaptrack data file to compare to. If set, this file will be used as a base and its cost gets subtracted from the primary data costs.</qt>
it: <qt>Puoi specificare facoltativamente un secondo file di dati heaptrack da confrontare. Se impostato, questo file sarà utilizzato come base e il suo costo viene sottratto dai costi di dati principali.</qt>

source: Profile &Data:
eo: &Datumoj de Profilo:
it: &Dati profilo:

source: Compare to:
eo: Kompari al:
it: Confronta con:

source: Suppressions:
eo: Subpremoj:
it: Soppressioni:

source: path/to/lsan_suppressions.txt
eo: vojo/al/lsan_suppressions.txt
it: percorso/a/lsan_suppressions.txt

source: Summary
eo: Resumo
it: Riepilogo

source: List of functions that allocated the most memory at a given time.
eo: Listo de funkcioj kiuj asignis la plej multe da memoro en difinita tempo.
it: Elenco di funzioni che hanno allocato la maggior parte della memoria in un determinato momento.

source: Peak Contributions
eo: Pintaj Kontribuoj
it: Contributi di picco
