Repository: KDE/heaptrack
Catalog: po/*/heaptrack.po
Languages: eo, it

source: List of functions that leak the most memory.
eo: Listo de funkcioj, kiuj likas la plej multe da memoro.
it: Elenco di funzioni che perdono la maggior parte della memoria.

source: Largest Memory Leaks
eo: Plej Grandaj Memorfluoj
it: Perdite di memoria più grandi

source: List of functions that allocate memory most often.
eo: Listo de funkcioj, kiuj plej ofte asignas memoron.
it: Elenco di funzioni che allocano la memoria più spesso.

source: Most Memory Allocations
eo: Plej Memoraj Atribuoj
it: Maggior parte delle allocazioni di memoria

source: List of functions that produced the most temporary memory allocations.
eo: Listo de funkcioj kiuj produktis la plej provizorajn memorajn asignojn.
it: Elenco di funzioni che hanno prodotto la maggior parte delle allocazioni di memoria temporanee.

source: Most Temporary Allocations
eo: Plej Provizora Asignoj
it: Maggior parte delle allocazioni temporanee

source: Suppressions
eo: Subpremoj
it: Soppressioni

source: Bottom-Up
eo: Malsupre-Supren
it: Dal basso verso l'alto

source: filter by function...
eo: filtri per funkcio...
it: filtra per funzione...

source: filter by file...
eo: filtri per dosiero...
it: filtra per file...

source: filter by module...
eo: filtri laŭ modulo...
it: filtra per modulo...

source: Caller / Callee
eo: Alvokanto / Callee
it: Chiamante / Chiamato

source: Top-Down
eo: Desupre
it: Dall'alto al basso

source: Flame Graph
eo: Flama Grafiko
it: Grafico a fiamma

source: S&tacks
eo: S&takoj
it: S&tack

source: Selected Stack:
eo: Elektita Stako:
it: Stack selezionato:

source: Setti&ngs
eo: Ag&ordo
it: Impostazio&ni

source: Filter
eo: Filtri
it: Filtro

source: merging allocations... %1%
eo: kunfandante asignojn... %1%
it: unione delle allocazioni... %1 %

source: total
eo: entute
it: totale

source: 0B to 8B
eo: 0B ĝis 8B
it: da 0B a 8B

source: 9B to 16B
eo: 9B ĝis 16B
it: da 9B a 16B

source: 17B to 32B
eo: 17B ĝis 32B
it: da 17B a 32B

source: 33B to 64B
eo: 33B ĝis 64B
it: da 33B a 64B

source: 65B to 128B
eo: 65B ĝis 128B
it: da 65B a 128B

source: 129B to 256B
eo: 129B ĝis 256B
it: da 129B a 256B

source: 257B to 512B
eo: 257B ĝis 512B
it: da 257B a 512B

source: 512B to 1KB
eo: 512B ĝis 1KB
it: da 512B a 1KB

source: more than 1KB
eo: pli ol 1KB
it: più di 1KB

source: reparsing data
eo: reparante datumojn
it: nuova elaborazione dei dati

source: parsing data
eo: analizado de datumoj
it: elaborazione dati

source: %1 pass: %2/%3 spent: %4 remaining: %5
eo: %1 preterpaso: %2/%3 elspezita: %4 restanta: %5
it: %1 passaggio: %2/%3 speso: %4 rimanente: %5

source: merging allocations...
eo: kunfandante asignojn...
it: unione delle allocazioni...

source: building size histogram...
eo: konstrugranda histogramo...
it: generazione dell'istogramma delle dimensioni...

source: building charts...
eo: konstruante leterojn...
it: generazione dei grafici...

source: <qt>The number of times an allocation function was called from this location.</qt>
it: <qt>Il numero di volte in cui una funzione di allocazione è stata invocata da questa posizione.</qt>

source: <qt>The number of temporary allocations. These allocations are directly followed by a free without any other allocations in-between.</qt>
it: <qt>Il numero di allocazioni temporanee. Queste allocazioni sono direttamente seguite da una libera senza altre allocazioni in mezzo.</qt>

source: <qt>The contributions from a given location to the maximum heap memory consumption in bytes. This takes deallocations into account.</qt>
it: <qt>I contributi da una determinata posizione al consumo di memoria massimo in byte. Questo tiene conto delle deallocazioni.</qt>

source: <qt>The location from which an allocation function was called. Function symbol and file information may be unknown when debug information was missing when heaptrack was run.</qt>
it: <qt>La posizione da cui era stata invocata una funzione di allocazione. Il simbolo della funzione e le informazioni sul file possono essere sconosciute quando mancavano informazioni sul debug durante l'esecuzione di heaptrack. </qt>

source: peak contribution: %1 (%2% of total)
eo: pinta kontribuo: %1 (%2% de totalo)
it: contributo di picco: %1 (%2% del totale)

source: leaked: %1 (%2% of total)
eo: likita: %1 (%2% de totalo)
it: persa: %1 (%2% del totale)

source: allocations: %1 (%2% of total)
eo: asignoj: %1 (%2% de totalo)
it: allocazioni: %1 (%2% del totale)

source: temporary: %1 (%2% of allocations, %3% of total)
eo: provizora: %1 (%2% de asignoj, %3% de totalo)
it: temporanea: %1 (%2% delle allocazioni, %3% del totale)

source: called from one location
it: chiamato da una posizione

source: %1: %2<br/>&nbsp;&nbsp;%4% out of %3 total
eo: %1: %2<br/>&nbsp;&nbsp;%4% el %3 entute
it: %1: %2<br/>&nbsp;&nbsp;%4% di %3 totali

source: %1 (self): %2<br/>&nbsp;&nbsp;%4% out of %3 total
eo: %1 (mem): %2<br/>&nbsp;&nbsp;%4% el %3 entute
it: %1 (self): %2 <br/>&nbsp;&nbsp; %4 % su %3 totali

source: %1 (inclusive): %2<br/>&nbsp;&nbsp;%4% out of %3 total
eo: %1 (inkluzive): %2<br/>&nbsp;&nbsp;%4% el %3 entute
it: %1 (inclusi): %2<br/>&nbsp;&nbsp; %4% su %3 totali

source: symbol: <tt>%1</tt><br/>binary: <tt>%2 (%3)</tt>
eo: simbolo: <tt>%1</tt><br/>duuma: <tt>%2 (%3)</tt>
it: simbolo: <tt>%1</tt><br/>binario: <tt>%2 (%3) </tt>

source: <unresolved function>
eo: <nesolvita funkcio>
it: <funzione non risolta>

source: Copyright 2015, Milian Wolff <mail@milianw.de>
eo: Kopirajto 2015, Milian Wolff <mail@milianw.de>

source: [FILE...]
eo: [DOSIERO...]

source: <dt><b>debuggee</b>:</dt><dd style='font-family:monospace;'>%1</dd>
eo: <dt><b>sencimigi</b>:</dt><dd style='font-family:monospace;'>%1</dd>

source: &File
eo: &Dosiero

source: Backtrace
eo: Retrospuro

source: backtrace:
eo: retrospuro:

# %1: function name, %2: binary basename
source: %1 in %2
eo: %1 en %2
